## Outer Join

In [3]:
import pandas as pd

In [4]:
men2004 = pd.read_csv("../Course_Materials_Part2/Video_Lecture_NBs/men2004.csv")
men2008 = pd.read_csv("../Course_Materials_Part2/Video_Lecture_NBs/men2008.csv")

In [5]:
men2004.head()

            Athlete  Medals
0   PHELPS, Michael       8
1       THORPE, Ian       4
2  SCHOEMAN, Roland       3
3    PEIRSOL, Aaron       3
4      CROCKER, Ian       3

In [6]:
men2004.shape

(59, 2)

In [7]:
men2008.head()

               Athlete  Medals
0      PHELPS, Michael       8
1         LOCHTE, Ryan       4
2       BERNARD, Alain       3
3      SULLIVAN, Eamon       3
4  LAUTERSTEIN, Andrew       3

In [9]:
men2008.shape

(62, 2)

In [10]:
len(men2004) + len(men2008)

121

In [17]:
men2004.merge(men2008, how='outer', on='Athlete', suffixes=["_2004", "_2008"], indicator=True)

              Athlete  Medals_2004  Medals_2008      _merge
0     PHELPS, Michael          8.0          8.0        both
1         THORPE, Ian          4.0          NaN   left_only
2    SCHOEMAN, Roland          3.0          NaN   left_only
3      PEIRSOL, Aaron          3.0          3.0        both
4        CROCKER, Ian          3.0          1.0        both
..                ...          ...          ...         ...
100  LAGUNOV, Evgeniy          NaN          1.0  right_only
101     BERENS, Ricky          NaN          1.0  right_only
102      LURZ, Thomas          NaN          1.0  right_only
103   MALLET, Gregory          NaN          1.0  right_only
104        ZHANG, Lin          NaN          1.0  right_only

[105 rows x 4 columns]

In [19]:
men0408 = men2004.merge(men2008, how='outer', on='Athlete', suffixes=["_2004", "_2008"], indicator=True)

In [20]:
men0408._merge

0            both
1       left_only
2       left_only
3            both
4            both
          ...
100    right_only
101    right_only
102    right_only
103    right_only
104    right_only
Name: _merge, Length: 105, dtype: category
Categories (3, object): ['left_only', 'right_only', 'both']

In [21]:
men0408._merge.value_counts()

right_only    46
left_only     43
both          16
Name: _merge, dtype: int64